%packages --ignoremissing

# Version Control
git-all
gitg
gitk
mercurial
subversion

# Vim
vim-X11
vim-enhanced

# Python
Cython
PyOpenGL
ipython
numpy
opencv-python
protobuf-python
pyaudio
pydot
pygame
pylint
pypy
pypy3
pytest
python-BeautifulSoup
python-devel
python-django
python-django-doc
python-docs
python-docutils
python-flask
python-matplotlib
python-nltk
python-nose
python-pep8
python-pygments
python-rope
python-setuptools
python-sphinx
python-sqlalchemy
python-virtualenv
python3-docutils
python3-ipython
python3-matplotlib
python3-nltk
python3-numpy
python3-pep8
python3-pylint
python3-pytest
python3-scipy
python3-setuptools
python3-sympy
scipy
sympy

# C/C++
SDL
SDL-devel
SDL_ttf
SDL_ttf-devel
automake
boost
boost-devel
boost-filesystem
boost-math
boost-random
boost-regex
clang
cmake
ctags
gcc
gcc-c++
libtool
ncurses
ncurses-devel
valgrind-devel

# Go
golang
golang-godoc
golang-googlecode-goprotobuf
golang-vet

# Tools
ack
arandr
asciinema
bash-completion
beep
cowsay
dia
finch
gnuplot
gparted
graphviz
nspluginwrapper
pssh
screen
tmux
transmission-gtk
xfig

# Graphics
evince
gimp
gimp-help

# Extras
audacity
ffmpeg
google-chrome-stable
gstreamer-ffmpeg
gstreamer-plugins-bad
gstreamer-plugins-bad-extras
gstreamer-plugins-base
gstreamer-plugins-good
gstreamer-plugins-ugly
lame
levien-inconsolata-fonts
libdvdnav
libdvdnav
libdvdread
libquicktime
mencoder
mplayer
unrar
vlc
xmms-mp3

# Removal
- abrt
- clipit
- iok
- xpad
- osmo
- sylpheed
- midori
- xfig
- pidgin

%end
